/******************************************************************************
 *	Copyright (C) 2015	Alejandro Colomar Andrés		      *
 ******************************************************************************/

		/* bool */
	#include <stdbool.h>
		/* srand() */
	#include <stdlib.h>
		/* strcpy() */
	#include <string.h>
		/* clock_t & clock() & time() */
	#include <time.h>
		/* getpid() */
	#include <unistd.h>

		/* seedf() */
	#include "alx_seed.h"

	#include "data.h"


/*
 *	[][][0] = Valor real	< 0:	0 minas cercanas y todas las cercanas descubiertas
 *				0-8:	N.º de minas cercanas
 *				> 8:	Mina
 *
 *	[][][1] = Estado	0:	Oculta
 *				1:	Descubierta
 *				2:	Bandera V
 *				3:	Bandera F
 *
 *	Interfaz		+:	Celda oculta
 *				·:	0 minas cercanas
 *				1-8:	N.º de minas cercanas
 *				#:	Mina marcada
 *				M:	Mina no explotada
 *				N:	No había mina
 *				X:	Mina explotada
 */


/******************************************************************************
 ******* variables ************************************************************
 ******************************************************************************/
struct Board	board;

clock_t		tim_0;
clock_t		tim_1;
double		tim_tot;

enum Flag_s	flag_s;
enum Flag_V	flag_V;
enum Flag_x	flag_x;

char		file_name [FILENAME_MAX];
char		file_path [FILENAME_MAX];
int		seed;


/******************************************************************************
 ******* functions ************************************************************
 ******************************************************************************/
void	init_values	(void)
{
	board.p =	0.05;

	board.rows =	10;
	board.cols =	10;

	strcpy(file_name, DEFAULT_SAVE);

	flag_s =	START_FOO;
	flag_V =	1;
	flag_x =	false;

	seed =		seedf(clock(), time(NULL), getpid());
	srand(seed);
}

/******************************************************************************
 ******************************************************************************
 **** END OF FILE *************************************************************
 ******************************************************************************
 ******************************************************************************/

/******************************************************************************
 ******************************************************************************
 **** END OF FILE *************************************************************
 ******************************************************************************
 ******************************************************************************/
